{
  "navbar": {
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "dark_theme": "Dark theme",
    "light_theme": "Light theme",
    "contact": "Contact"
  },
  "about": {
    "title": "I'm a full-stack web developer who specializes in nice front-end web designs",
    "description": "and together we can build your next big project. 🙂"
  },
  "skills": {
    "title": "My Skills",
    "skill": {
      "react_desc": "ReactJS is a JavaScript framework for building fast and interactive user interfaces for websites and web apps. It is one of the most widely used JavaScript frameworks",
      "react_exp": "1+ year of experience building components for websites.",
      "vue_desc": "Vue.js is a JavaScript framework for building user interfaces. The core library is focused on the view layer only, making it easy to integrate with other libraries or existing projects.",
      "vue_exp":"3+ years of experience creating websites with easy-to-use components",
      "javascript_desc": "JavaScript is a high-level, interpreted programming language. It allows you to implement complex features on web pages and is an essential part of web applications.",
      "javascript_exp": "5+ years of creating complex functions",
      "typescript_desc": "TypeScript is a strongly typed programming language that builds on JavaScript. It adds static types to JavaScript, helping to catch errors early and make JavaScript development more efficient.",
      "typescript_exp": "1+ year of adding types to variables",
      "tailwind_desc": "TailwindCSS is a CSS framework packed with classes that can be used to build any design. It provides low-level utility classes that let you build completely custom designs.",
      "tailwind_exp": "1+ year of using low-level utility classes",
      "daisy_desc": "DaisyUI is a plugin for Tailwind CSS that adds semantic class names and component classes. It provides ready-to-use components built with Tailwind CSS.",
      "daisy_exp": "1+ year of using ready-to-use components",
      "HTML_desc": "HTML5 is the latest version of the HTML standard. It includes new elements and attributes that reflect typical usage on modern websites.",
      "HTML_exp": "5+ years of creating web pages",
      "node_desc": "Node.js is an open-source, back-end JavaScript runtime environment. It lets you use JavaScript code outside a web browser for backend development",
      "node_exp": "3+ years of backend development",
      "API_desc": "A RESTful API is a way for websites and servers to communicate with each other. RESTful applications use HTTP requests to perform CRUD (Create, Read, Update, Delete) operations on resources.",
      "API_exp": "5+ years of performing CRUD requests",
      "firebase_desc": "Firebase is a platform that helps developers build apps without needing to manage servers. It provides tools for things like real-time database, authentication services, hosting, cloud functions and push notifications.",
      "firebase_exp": "2+ years of using real-time databases"
    }
  },
  "projects": {
    "project_1": {
      "title": "Discord Bot",
      "description": "This is a Discord Bot that will perform certain predefined actions upon receiving commands from users.",
      "src": "./placeholder.svg",
      "coming_soon": "Coming soon!",
      "view": ""
    },
    "title": "Featured Projects",
    "project": "Project",
    "coming_soon": "Coming soon!",
    "view": "View Project"
  },
  "contact": {
    "title": "Get in Touch",
    "name": "Name",
    "name_placeholder": "John Smith",
    "email": "Email",
    "email_placeholder": "JohnSmith@email.com",
    "message": "Message",
    "message_placeholder": "Write me a message! (Comments, suggestions, remarks, small details, business inquiries, how did you find this website? Requests for Valorant...)",
    "send_message": "Send message",
    "message_file_type_error": "Only PNG, JPG, JPEG, and PDF files are allowed.",
    "message_file_size_error": "File size must be under 5MB.",
    "message_loading": "Sending...",
    "server_response": {
      "error_invalid_method": "Invalid method. How did you do this?",
      "error_parsing": "Parsing error. What did you just send me?",
      "error_missing_required_fields": "There are missing required fields. Please fill all required fields (Name, Email, Message).",
      "error_invalid_email": "Invalid email. Please make sure the email is correct.",
      "error_spam": "Something went wrong. Please try again later or refresh the page.",
      "error_message_too_long": "Your message is too long. (max. 1000 characters)",
      "success_sent": "Your message has been sent successfully!",
      "error_sent": "There was an error while trying to send your message. Please try again."
    },
    "file_restrictions": "5MB max, png, jpg, pdf",
    "file": "Upload a file"
  },
  "footer": {
    "copyright": "All rights reserved."
  },
  "modal": {
    "previous": "Previous skill",
    "next": "Next skill",
    "close": "Close modal",
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "learn": "Learn more"
  }
}

