{
  "navbar": {
    "about": "À propos",
    "skills": "Compétences",
    "projects": "Projets",
    "dark_theme": "Thème sombre",
    "light_theme": "Thème clair",
    "contact": "Contact"
  },
  "about": {
    "title": "Je suis un développeur web full-stack spécialisé dans les beaux designs front-end",
    "description": "et ensemble, nous pouvons construire votre prochain grand projet. 🙂"
  },
  "skills": {
    "title": "Mes compétences",
    "skill": {
    "react_desc": "ReactJS est un framework JavaScript permettant de créer des interfaces utilisateur rapides et interactives pour les sites web et les applications web. C'est l'un des frameworks JavaScript les plus utilisés.",
    "react_exp": "1+ année d'expérience dans la création de composants pour les sites web.",
    "vue_desc": "Vue.js est un framework JavaScript pour la création d'interfaces utilisateur. Sa bibliothèque principale est axée uniquement sur la couche d'affichage, ce qui facilite son intégration avec d'autres bibliothèques ou projets existants.",
    "vue_exp":"3+ années d'expérience dans la création de sites web avec des composants faciles à utiliser.",
    "javascript_desc": "JavaScript est un langage de programmation interprété de haut niveau. Il permet d'ajouter des fonctionnalités complexes aux pages web et constitue une partie essentielle des applications web.",
    "javscript_exp": "5+ années d'expérience dans la création de fonctions complexes",
    "typescript_desc": "TypeScript est un langage de programmation fortement typé basé sur JavaScript. Il ajoute des types statiques à JavaScript, ce qui permet de détecter les erreurs plus tôt et de rendre le développement JavaScript plus efficace.",
    "typescript_exp": "1+ année d'expérience dans l'ajout de types sur les variables",
    "tailwind_desc": "TailwindCSS est un framework CSS rempli de classes permettant de créer n'importe quel design. Il fournit des classes utilitaires de bas niveau qui permettent de concevoir des interfaces entièrement personnalisées.",
    "tailwind_exp": "1+ année d'expérience dans l'utilisation de classes de bas niveau",
    "daisy_desc": "DaisyUI est un plugin pour Tailwind CSS qui ajoute des noms de classes sémantiques et des composants préconçus. Il fournit des composants prêts à l'emploi construits avec Tailwind CSS.",
    "daisy_exp": "1+ année d'expérience dans l'utilisation de composants prêts à être utilisés",
    "HTML_desc": "HTML5 est la dernière version de la norme HTML. Il introduit de nouveaux éléments et attributs qui reflètent les usages courants sur les sites web modernes.",
    "HTML_exp": "5+ années d'expérience dans la création de pages web.",
    "node_desc": "Node.js est un environnement d'exécution JavaScript open-source côté serveur. Il permet d'exécuter du code JavaScript en dehors d'un navigateur web pour le développement backend.",
    "node_exp": "3+ années d'expérience dans le développement backend.",
    "API_desc": "Une API RESTful est un moyen de communication entre les sites web et les serveurs. Les applications RESTful utilisent des requêtes HTTP pour effectuer des opérations CRUD (Créer, Lire, Mettre à jour, Supprimer) sur des ressources.",
    "API_exp": "5+ années d'expérience dans l'exécution de requêtes CRUD.",
    "firebase_desc": "Firebase est une plateforme qui aide les développeurs à créer des applications sans avoir à gérer de serveurs. Elle propose des outils tels qu'une base de données en temps réel, des services d'authentification, de l'hébergement, des fonctions cloud et des notifications push.",
    "firebase_exp": "2+ années d'expérience dans l'utilisation de bases de données en temps réel."
  }
  },
  "projects": {
    "project_1": {
      "title": "Bot Discord",
      "description": "Ce projet est un bot Discord qui effectue des actions selon les commandes de ses utilisateurs.",
      "src": "./placeholder.svg"
    },
    "title": "Mes projets",
    "project": "Projets",
    "view": "Voir le projet"
  },
  "contact": {
    "title": "Contactez-moi",
    "name": "Nom",
    "name_placeholder": "John Smith",
    "email": "Courriel",
    "email_placeholder": "JohnSmith@email.com",
    "message": "Message",
    "message_placeholder": "Écriver moi un message! (Commentaires, suggestions, remarques, petits détails, demandes d'affaires, comment avez-vous retrouvé ce site web? Demande pour Valorant...)",
    "send_message": "Envoyer un message",
    "message_file_type_error": "Seulement les fichiers PNG, JPG, JPEG, et PDF sont permis",
    "message_file_size_error": "La taille du fichier doit être en-dessous de 5MB.",
    "message_loading": "Envoi en cours...",
    "server_response": {
      "error_invalid_method": "Méthode invalide. Comment avez-vous fait ça?",
      "error_parsing": "Erreur d'analyse. Qu'est-ce que vous m'avez envoyé?",
      "error_missing_required_fields": "Champs requis manquants. Veuillez remplir tous les champs obligatoirs (nom, courriel, message).",
      "error_invalid_email": "Courriel invalide. Veuillez vous assurer que l'adresse courriel est correcte.",
      "error_spam": "Une erreur est survenue. Veuillez réessayer plus tard ou rafraîchir la page.",
      "error_message_too_long": "Votre message est trop long. (max. 1000 caractères).",
      "success_sent": "Votre message a été envoyé avec succès!",
      "error_sent": "Une erreur est survenue lors de l'envoi de votre message. Veuillez reéssayer."
    },
    "file_restrictions": "5MB max, png, jpg, pdf",
    "file": "Téléchargez un fichier"
  },
  "footer": {
    "copyright": "Tous droits réservés"
  },
  "modal": {
    "previous": "Dernière compétence",
    "next": "Prochaine compétence",
    "close": "Fermer la modale",
    "about": "À propos",
    "experience": "Expérience",
    "projects": "Projets",
    "learn": "Apprendre plus"
  }
}
